MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19186/mcu.h
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0x1D23);
// bitfield macros
#define _LCDDATA11_S40C1_POSN                               0x0
#define _LCDDATA11_S40C1_POSITION                           0x0
#define _LCDDATA11_S40C1_SIZE                               0x1
#define _LCDDATA11_S40C1_LENGTH                             0x1
#define _LCDDATA11_S40C1_MASK                               0x1
#define _LCDDATA11_S41C1_POSN                               0x1
#define _LCDDATA11_S41C1_POSITION                           0x1
#define _LCDDATA11_S41C1_SIZE                               0x1
#define _LCDDATA11_S41C1_LENGTH                             0x1
#define _LCDDATA11_S41C1_MASK                               0x2
#define _LCDDATA11_S42C1_POSN                               0x2
#define _LCDDATA11_S42C1_POSITION                           0x2
#define _LCDDATA11_S42C1_SIZE                               0x1
#define _LCDDATA11_S42C1_LENGTH                             0x1
#define _LCDDATA11_S42C1_MASK                               0x4
#define _LCDDATA11_S43C1_POSN                               0x3
#define _LCDDATA11_S43C1_POSITION                           0x3
#define _LCDDATA11_S43C1_SIZE                               0x1
#define _LCDDATA11_S43C1_LENGTH                             0x1
#define _LCDDATA11_S43C1_MASK                               0x8
#define _LCDDATA11_S44C1_POSN                               0x4
#define _LCDDATA11_S44C1_POSITION                           0x4
#define _LCDDATA11_S44C1_SIZE                               0x1
#define _LCDDATA11_S44C1_LENGTH                             0x1
#define _LCDDATA11_S44C1_MASK                               0x10
#define _LCDDATA11_S45C1_POSN                               0x5
#define _LCDDATA11_S45C1_POSITION                           0x5
#define _LCDDATA11_S45C1_SIZE                               0x1
#define _LCDDATA11_S45C1_LENGTH                             0x1
#define _LCDDATA11_S45C1_MASK                               0x20
#define _LCDDATA11_S46C1_POSN                               0x6
#define _LCDDATA11_S46C1_POSITION                           0x6
#define _LCDDATA11_S46C1_SIZE                               0x1
#define _LCDDATA11_S46C1_LENGTH                             0x1
#define _LCDDATA11_S46C1_MASK                               0x40
#define _LCDDATA11_S47C1_POSN                               0x7
#define _LCDDATA11_S47C1_POSITION                           0x7
#define _LCDDATA11_S47C1_SIZE                               0x1
#define _LCDDATA11_S47C1_LENGTH                             0x1
#define _LCDDATA11_S47C1_MASK                               0x80

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0x1D24);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 01D24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C2                  :1;
        unsigned S01C2                  :1;
        unsigned S02C2                  :1;
        unsigned S03C2                  :1;
        unsigned S04C2                  :1;
        unsigned                        :1;
        unsigned S06C2                  :1;
        unsigned S07C2                  :1;
    };
} LCDDATA12bits_t;
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0x1D24);
// bitfield macros
#define _LCDDATA12_S00C2_POSN                               0x0
#define _LCDDATA12_S00C2_POSITION                           0x0
#define _LCDDATA12_S00C2_SIZE                               0x1
#define _LCDDATA12_S00C2_LENGTH                             0x1
#define _LCDDATA12_S00C2_MASK                               0x1
#define _LCDDATA12_S01C2_POSN                               0x1
#define _LCDDATA12_S01C2_POSITION                           0x1
#define _LCDDATA12_S01C2_SIZE                               0x1
#define _LCDDATA12_S01C2_LENGTH                             0x1
#define _LCDDATA12_S01C2_MASK                               0x2
#define _LCDDATA12_S02C2_POSN                               0x2
#define _LCDDATA12_S02C2_POSITION                           0x2
#define _LCDDATA12_S02C2_SIZE                               0x1
#define _LCDDATA12_S02C2_LENGTH                             0x1
#define _LCDDATA12_S02C2_MASK                               0x4
#define _LCDDATA12_S03C2_POSN                               0x3
#define _LCDDATA12_S03C2_POSITION                           0x3
#define _LCDDATA12_S03C2_SIZE                               0x1
#define _LCDDATA12_S03C2_LENGTH                             0x1
#define _LCDDATA12_S03C2_MASK                               0x8
#define _LCDDATA12_S04C2_POSN                               0x4
#define _LCDDATA12_S04C2_POSITION                           0x4
#define _LCDDATA12_S04C2_SIZE                               0x1
#define _LCDDATA12_S04C2_LENGTH                             0x1
#define _LCDDATA12_S04C2_MASK                               0x10
#define _LCDDATA12_S06C2_POSN                               0x6
#define _LCDDATA12_S06C2_POSITION                           0x6
#define _LCDDATA12_S06C2_SIZE                               0x1
#define _LCDDATA12_S06C2_LENGTH                             0x1
#define _LCDDATA12_S06C2_MASK                               0x40
#define _LCDDATA12_S07C2_POSN                               0x7
#define _LCDDATA12_S07C2_POSITION                           0x7
#define _LCDDATA12_S07C2_SIZE                               0x1
#define _LCDDATA12_S07C2_LENGTH                             0x1
#define _LCDDATA12_S07C2_MASK                               0x80

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
extern volatile unsigned char           LCDDATA13           __at(0x1D25);
#ifndef _LIB_BUILD
asm("LCDDATA13 equ 01D25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C2                  :1;
        unsigned S09C2                  :1;
        unsigned S10C2                  :1;
        unsigned S11C2                  :1;
        unsigned                        :1;
        unsigned S13C2                  :1;
        unsigned S14C2                  :1;
        unsigned S15C2                  :1;
    };
} LCDDATA13bits_t;
extern volatile LCDDATA13bits_t LCDDATA13bits __at(0x1D25);
// bitfield macros
#define _LCDDATA13_S08C2_POSN                               0x0
#define _LCDDATA13_S08C2_POSITION                           0x0
#define _LCDDATA13_S08C2_SIZE                               0x1
#define _LCDDATA13_S08C2_LENGTH                             0x1
#define _LCDDATA13_S08C2_MASK                               0x1
#define _LCDDATA13_S09C2_POSN                               0x1
#define _LCDDATA13_S09C2_POSITION                           0x1
#define _LCDDATA13_S09C2_SIZE                               0x1
#define _LCDDATA13_S09C2_LENGTH                             0x1
#define _LCDDATA13_S09C2_MASK                               0x2
#define _LCDDATA13_S10C2_POSN                               0x2
#define _LCDDATA13_S10C2_POSITION                           0x2
#define _LCDDATA13_S10C2_SIZE                               0x1
#define _LCDDATA13_S10C2_LENGTH                             0x1
#define _LCDDATA13_S10C2_MASK                               0x4
#define _LCDDATA13_S11C2_POSN                               0x3
#define _LCDDATA13_S11C2_POSITION                           0x3
#define _LCDDATA13_S11C2_SIZE                               0x1
#define _LCDDATA13_S11C2_LENGTH                             0x1
#define _LCDDATA13_S11C2_MASK                               0x8
#define _LCDDATA13_S13C2_POSN                               0x5
#define _LCDDATA13_S13C2_POSITION                           0x5
#define _LCDDATA13_S13C2_SIZE                               0x1
#define _LCDDATA13_S13C2_LENGTH                             0x1
#define _LCDDATA13_S13C2_MASK                               0x20
#define _LCDDATA13_S14C2_POSN                               0x6
#define _LCDDATA13_S14C2_POSITION                           0x6
#define _LCDDATA13_S14C2_SIZE                               0x1
#define _LCDDATA13_S14C2_LENGTH                             0x1
#define _LCDDATA13_S14C2_MASK                               0x40
#define _LCDDATA13_S15C2_POSN                               0x7
#define _LCDDATA13_S15C2_POSITION                           0x7
#define _LCDDATA13_S15C2_SIZE                               0x1
#define _LCDDATA13_S15C2_LENGTH                             0x1
#define _LCDDATA13_S15C2_MASK                               0x80

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
extern volatile unsigned char           LCDDATA14           __at(0x1D26);
#ifndef _LIB_BUILD
asm("LCDDATA14 equ 01D26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned S18C2                  :1;
        unsigned S19C2                  :1;
        unsigned S20C2                  :1;
        unsigned                        :1;
        unsigned S22C2                  :1;
        unsigned S23C2                  :1;
    };
} LCDDATA14bits_t;
extern volatile LCDDATA14bits_t LCDDATA14bits __at(0x1D26);
// bitfield macros
#define _LCDDATA14_S18C2_POSN                               0x2
#define _LCDDATA14_S18C2_POSITION                           0x2
#define _LCDDATA14_S18C2_SIZE                               0x1
#define _LCDDATA14_S18C2_LENGTH                             0x1
#define _LCDDATA14_S18C2_MASK                               0x4
#define _LCDDATA14_S19C2_POSN                               0x3
#define _LCDDATA14_S19C2_POSITION                           0x3
#define _LCDDATA14_S19C2_SIZE                               0x1
#define _LCDDATA14_S19C2_LENGTH                             0x1
#define _LCDDATA14_S19C2_MASK                               0x8
#define _LCDDATA14_S20C2_POSN                               0x4
#define _LCDDATA14_S20C2_POSITION                           0x4
#define _LCDDATA14_S20C2_SIZE                               0x1
#define _LCDDATA14_S20C2_LENGTH                             0x1
#define _LCDDATA14_S20C2_MASK                               0x10
#define _LCDDATA14_S22C2_POSN                               0x6
#define _LCDDATA14_S22C2_POSITION                           0x6
#define _LCDDATA14_S22C2_SIZE                               0x1
#define _LCDDATA14_S22C2_LENGTH                             0x1
#define _LCDDATA14_S22C2_MASK                               0x40
#define _LCDDATA14_S23C2_POSN                               0x7
#define _LCDDATA14_S23C2_POSITION                           0x7
#define _LCDDATA14_S23C2_SIZE                               0x1
#define _LCDDATA14_S23C2_LENGTH                             0x1
#define _LCDDATA14_S23C2_MASK                               0x80

